test/Lagrangian/bubbles/system/Lagrangian/bubbles/LagrangianSolution.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/Lagrangian/bubbles";
    object      LagrangianSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

outerCorrectors no;

maxTimeStepFraction 1e300;

maxCellLengthScaleFraction 1e300;

nCorrectors     0;

// ************************************************************************* //
